Revit 2027 API
ExportTextQualifier Enumeration
 Options for the text qualifier character in schedule view export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportTextQualifier
Public Enumeration ExportTextQualifier
public enum class ExportTextQualifier
type ExportTextQualifier
Members
Member name | Value | Description
DoubleQuote | 2 |  The quote character - " - is used to qualify text.
None | 0 |  No text qualifier.
Quote | 1 |  The quote character - ' - is used to qualify text.
See Also
Reference
Autodesk.Revit.DB Namespace